## DataFrame

## 아래와 같은 데이터프레임 df를 생성 및 출력 해보세요.

In [1]:
import pandas as pd
# 코드 작성 칸

   name  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

## age 및 children 컬럼을 선택하여 출력하세요.

In [2]:
# 코드 작성 칸

   age  children
a   24         2
b   27         1
c   34         3

## age 컬럼명을 score로 컬럼명을 변경해 주세요 
## +조건 : columns 및 inplace 매개변수 사용

In [3]:
# 코드 작성 칸

   name  score  children
a   Kim     24         2
b   Lee     27         1
c  Park     34         3

# Pandas 파일 입출력

## 모듈 import

In [5]:
from IPython.display import Image
import numpy as np
import pandas as pd

## 데이터 다운로드

In [6]:
!wget -N --http-user=mysuni --http-passwd=mysuni1! http://sk.jaen.kr:8080/seoul_transportation.xlsx

--2021-10-20 07:02:27--  http://sk.jaen.kr:8080/seoul_transportation.xlsx
Resolving sk.jaen.kr (sk.jaen.kr)... 49.247.134.238
Connecting to sk.jaen.kr (sk.jaen.kr)|49.247.134.238|:8080... connected.
HTTP request sent, awaiting response... 401 Unauthorized
Authentication selected: Basic realm="Authentication required."
Reusing existing connection to sk.jaen.kr:8080.
HTTP request sent, awaiting response... 200 OK
Length: 26250 (26K) [application/vnd.openxmlformats-officedocument.spreadsheetml.sheet]
Saving to: ‘seoul_transportation.xlsx’

seoul_transportatio 100%[===================>]  25.63K  --.-KB/s    in 0.03s

2021-10-20 07:02:28 (869 KB/s) - ‘seoul_transportation.xlsx’ saved [26250/26250]

# seoul_transportation.xlsx 파일(버스 sheet만 입력)을 읽어서 df에 저장하세요.
# "XLRDError: Excel xlsx file; not supported" 에러 발생 시, 매개변수로 engine='openpyxl' 를 입력해주세요.

In [6]:
# 코드 작성 칸

# 시트명을 조회하세요.

In [7]:
# 코드 작성 칸

Index(['대중교통구분', '년월', '승차총승객수'], dtype='object')

# df를 seoul_transportation_bus.csv로 저장하세요.
# 조건 : 인덱스 없이, 구분자는 |  <- 파이프라인 = shift+역슬래시

In [8]:
# 코드 작성 칸

# Pandas 조건 정렬 조건 필터

In [7]:
import numpy as np
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# `pclass`는 승객의 좌석등급을 나타내는 column 입니다. 좌석등급별 승객 데이터 분포를 확인해 주세요.

In [8]:
# 3-1.`pclass`는 승객의 좌석등급을 나타내는 column 입니다. 좌석등급별 승객 데이터 분포를 확인해 주세요.
# 코드를 입력해 주세요

# 3    491
# 1    216
# 2    184
# Name: pclass, dtype: int64
df['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

# sort_values 함수를 활용해 'age:내림차순', 'fare:오름차순' 순으로 정렬하세요.

In [9]:
# 3-2. sort_values 함수를 활용해 'age:내림차순', 'fare:오름차순' 순으로 정렬하세요.
# 코드를 입력해 주세요
df.sort_values(by = ['age', 'fare'], ascending=[False, True]).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [11]:
df.sort_values(by = ['age', 'fare'], ascending=[False, True], inplace=True)

In [12]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
306,1,1,female,NaN,0,0,110.8833,C,First,woman,False,NaN,Cherbourg,yes,True
334,1,1,female,NaN,1,0,133.6500,S,First,woman,False,NaN,Southampton,yes,False
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
527,0,1,male,NaN,0,0,221.7792,S,First,man,True,C,Southampton,no,True
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True

In [1]:
# DataFrame
## 1-1. 아래와 같은 데이터프레임 df를 생성 및 출력 해보세요.

import pandas as pd
# 코드 작성 칸

#	name	age	children
# a	Kim	24	2
# b	Lee	27	1
# c	Park	34	3


====
## 1-2. age 및 children 컬럼을 선택하여 출력하세요.
# 코드 작성 칸

# 	age	children
# a	24	2
# b	27	1
# c	34	3



====
## 1-3. age 컬럼명을 score로 컬럼명을 변경해 주세요 
## +조건 : columns 및 inplace 매개변수 사용
# 코드 작성 칸

# 	name	score	children
# a	Kim	24	2
# b	Lee	27	1
# c	Park	34	3





====
# Pandas 파일 입출력
## 모듈 import
from IPython.display import Image
import numpy as np
import pandas as pd
## 데이터 다운로드
!wget -N --http-user=mysuni --http-passwd=mysuni1! http://sk.jaen.kr:8080/seoul_transportation.xlsx


# 2-1. seoul_transportation.xlsx 파일(버스 sheet만 입력)을 읽어서 df에 저장하세요.
# "XLRDError: Excel xlsx file; not supported" 에러 발생 시, 매개변수로 engine='openpyxl' 를 입력해주세요.
# 코드 작성 칸


====
# 2-2. 시트명을 조회하세요.
# 코드 작성 칸


====
# 2-3. df를 seoul_transportation_bus.csv로 저장하세요.
# 조건 : 인덱스 없이, 구분자는 |  <-역슬래시
# 코드 작성 칸









====
# Pandas 조건 정렬 조건 필터
import numpy as np
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()
# survived	pclass	sex	age	sibsp	parch	fare	embarked	class	who	adult_male	deck	embark_town	alive	alone
# 0	0	3	male	22.0	1	0	7.2500	S	Third	man	True	NaN	Southampton	no	False
# 1	1	1	female	38.0	1	0	71.2833	C	First	woman	False	C	Cherbourg	yes	False
# 2	1	3	female	26.0	0	0	7.9250	S	Third	woman	False	NaN	Southampton	yes	True
# 3	1	1	female	35.0	1	0	53.1000	S	First	woman	False	C	Southampton	yes	False
# 4	0	3	male	35.0	0	0	8.0500	S	Third	man	True	NaN	Southampton	no	True



====
# 3-1.`pclass`는 승객의 좌석등급을 나타내는 column 입니다. 좌석등급별 승객 데이터 분포를 확인해 주세요.
# 코드를 입력해 주세요

# 3    491
# 1    216
# 2    184
# Name: pclass, dtype: int64



====
# 3-2. sort_values 함수를 활용해 'age:내림차순', 'fare:오름차순' 순으로 정렬하세요.
# 코드를 입력해 주세요

# 	survived	pclass	sex	age	sibsp	parch	fare	embarked	class	who	adult_male	deck	embark_town	alive	alone
# 630	1	1	male	80.0	0	0	30.0000	S	First	man	True	A	Southampton	yes	True
# 851	0	3	male	74.0	0	0	7.7750	S	Third	man	True	NaN	Southampton	no	True
# 96	0	1	male	71.0	0	0	34.6542	C	First	man	True	A	Cherbourg	no	True
# 493	0	1	male	71.0	0	0	49.5042	C	First	man	True	NaN	Cherbourg	no	True
# 116	0	3	male	70.5	0	0	7.7500	Q	Third	man	True	NaN	Queenstown	no	True

SyntaxError: invalid syntax (<ipython-input-1-f3537158a2d7>, line 13)

In [15]:
#강사님 제출 문제 2021.10.20 16:13
df = sns.load_dataset("titanic")
df.head()

# 나이가 30살 이상 남자 승객 조건 필터링

# 코드 작성

# fare를 많이 낸 순서로 내림차순 정렬

# 코드 작성

# 상위 10개를 출력

# 코드 작성

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [30]:
# 나이가 30살 이상 남자 승객 조건 필터링
df_age = df.loc[(df['age'] >= 30) & (df['who'] == 'man')]
df_age

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [25]:
# fare를 많이 낸 순서로 내림차순 정렬
df_age_fare = df_age.sort_values(by = 'fare', ascending=False)
df_age_fare

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
299,1,1,female,50.0,0,1,247.5208,C,First,woman,False,B,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
597,0,3,male,49.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
263,0,1,male,40.0,0,0,0.0000,S,First,man,True,B,Southampton,no,True
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,no,True
822,0,1,male,38.0,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
179,0,3,male,36.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True

In [26]:
df_age_fare.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
299,1,1,female,50.0,0,1,247.5208,C,First,woman,False,B,Cherbourg,yes,False
716,1,1,female,38.0,0,0,227.5250,C,First,woman,False,C,Cherbourg,yes,True
380,1,1,female,42.0,0,0,227.5250,C,First,woman,False,NaN,Cherbourg,yes,True
779,1,1,female,43.0,0,1,211.3375,S,First,woman,False,B,Southampton,yes,False
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
318,1,1,female,31.0,0,2,164.8667,S,First,woman,False,C,Southampton,yes,False

In [29]:
df_age_fare.loc[0, 'fare']

KeyError: 0